clc, clear, close all
x = [ -1, 0, 1, 3];
y = [-1, 1, 3, 31];
x_line = -2:0.1:4;
c1 = csape(x, y, 'complete', [4, 28]);
c2 = ppval(c1,x_line);
%d = fnder(c1, 1);
plot(x,y,'bo');
str=[repmat('   ',4,1),num2str(x') repmat(',',4,1) num2str(y')];
text(x,y,cellstr(str),'HorizontalAlignment', 'left');
title('三次样条插值结果');
xlabel('x');
ylabel('y');
hold on;
grid on
%plot(x_line,c2,'--b.');

syms x f0(x) f1(x) f2(x) f a b
f0 = -1 * (1 + 2 * (x + 1) / (0 + 1))*((x - 0) / (-1 - 0))^2 + ... 
     1 * (1 + 2 * (x - 0) / (-1 - 0))*((x + 1) / (0 + 1))^2 + ...
     4 * (x + 1) * ( (x - 0) / (-1 - 0))^2 + ...
     1 * (x - 0) * ( (x + 1) / (0 + 1))^2;
f1 = 1 * (1 + 2 * (x - 0) / (1 - 0))*((x - 1) / (0 - 1))^2 + ... 
     3 * (1 + 2 * (x - 1) / (0 - 1))*((x - 0) / (1 - 0))^2 + ...
     1 * (x - 0) * ( (x - 1) / (0 - 1))^2 + ...
     4 * (x - 1) * ( (x - 0) / (1 - 0))^2;
f2 = 3 * (1 + 2 * (x - 1) / (3 - 1))*((x - 3) / (1 - 3))^2 + ... 
     31 * (1 + 2 * (x - 3) / (1 - 3))*((x - 1) / (3 - 1))^2 + ...
     4 * (x - 1) * ( (x - 3) / (1 - 3))^2 + ...
     28 * (x - 3) * ( (x - 1) / (3 - 1))^2;

f3 = -2 * (1 + 2 * (x - 1) / (2 - 1))*((x - 2) / (1 - 2))^2 + ... 
     0 * (1 + 2 * (x - 3) / (1 - 3))*((x - 1) / (3 - 1))^2 + ...
     4 * (x - 1) * ( (x - 2) / (1 - 2))^2 + ...
     0 * (x - 3) * ( (x - 1) / (3 - 1))^2;

f4 = 0 * (1 + 2 * (x - 1) / (3 - 1))*((x - 3) / (1 - 3))^2 + ... 
     2 * (1 + 2 * (x - 3) / (2 - 3))*((x - 2) / (3 - 2))^2 + ...
     0 * (x - 1) * ( (x - 3) / (1 - 3))^2 + ...
     -4 * (x - 3) * ( (x - 2) / (3 - 2))^2;

s0 = simplify(f0);
s0 = expand(s0);
s1 = simplify(f1);
s1 = expand(s1);
s2 = simplify(f2);
s2 = expand(s2);
s3 = simplify(f3);
s3 = expand(s3);
s4 = simplify(f4);
s4 = expand(s4);
fplot(s0, [-2,0],'-r');
fplot(s1, [0,1],'-r');
fplot(s2, [1,4],'-r');
legend({'插值点','$S(x) = x^3 + x + 1$'},'Interpreter','latex','Location','northwest');


f = (x-2)^2 * (x-1) * (x-3);
s = expand(f);